class Consts:
    ERROR_MSG = """Сумма платежа меньше или равна месячным процентам."""
    ERROR_DELTA = """Дата выплаты меньше либо равна текущей"""
    ERROR_DATE = """Указана некорректная дата"""
    ERROR_CALC_TO_DATE = """Расчёт не попал в выборку, измените входные параметры"""
    MORTGAGE_TERM = 30  # на сколько лет дают ипотеку

    MONTH_DICT = {
        1: "Январь",
        2: "Февраль",
        3: "Март",
        4: "Апрель",
        5: "Май",
        6: "Июнь",
        7: "Июль",
        8: "Август",
        9: "Сентябрь",
        10: "Октябрь",
        11: "Ноябрь",
        12: "Декабрь",
    }
